const scheduleResource = {
    "group": "ІПЗ-41",
    "schedule": [
        {
            "date": "03.04.2020",
            "day": "П'ятниця",
            "items": [
                {
                    "number": "1",
                    "time_bounds": "08:30 - 09:50",
                    "info": "207 /  Кузь М.В.  (підгр. 2)  /  Аналіз вимог до програмного забезпечення (Лаб) /  "
                },
                {
                    "number": "2",
                    "time_bounds": "10:05 - 11:25",
                    "info": "232 /  Гайналь Т.О.  Філософія (Л) /  "
                },
                {
                    "number": "3",
                    "time_bounds": "11:55 - 13:15",
                    "info": "232 /  Гайналь Т.О.  Філософія (Сем) /  "
                }
            ]
        },
        {
            "date": "07.04.2020 ",
            "day": "Вівторок",
            "items": [
                {
                    "number": "1",
                    "time_bounds": "08:30 - 09:50",
                    "info": "320 /  Яновський (п) Ю.М. Збірна група ІПЗ(мп.) /  Програмування для iOS (Л) /  "
                },
                {
                    "number": "2",
                    "time_bounds": "10:05 - 11:25",
                    "info": "320 /  Яновський (п) Ю.М. Збірна група ІПЗ(мп.) /  Програмування для iOS (Лаб) /  "
                },
                {
                    "number": "3",
                    "time_bounds": "11:55 - 13:15",
                    "info": "232 /  Поплавський О.П.  БЖД та цивільний захист (Л) /  "
                }
            ]
        },
        {
            "date": "08.04.2020 ",
            "day": "Середа",
            "items": [
                {
                    "number": "2",
                    "time_bounds": "10:05 - 11:25",
                    "info": "318 /  Козленко М.І.  Штучний інтелект (Л) /  "
                },
                {
                    "number": "3",
                    "time_bounds": "11:55 - 13:15",
                    "info": "320 /  Козленко М.І.  (підгр. 2)  /  Штучний інтелект (Лаб) /  "
                },
                {
                    "number": "4",
                    "time_bounds": "13:30 - 14:50",
                    "info": "320 /  Козич* О.В. Збірна група ІПЗ(веб.) /  Скриптові технології розробки вебзастосунків. Аngular (Л) /  "
                },
                {
                    "number": "5",
                    "time_bounds": "15:05 - 16:25",
                    "info": "320 /  Козич* О.В. Збірна група ІПЗ(веб.) /  Скриптові технології розробки вебзастосунків. Аngular (Лаб) /  "
                }
            ]
        },
        {
            "date": "09.04.2020 ",
            "day": "Четвер",
            "items": [
                {
                    "number": "3",
                    "time_bounds": "11:55 - 13:15",
                    "info": "307 /  Козленко М.І.  (підгр. 2)  /  Безпека програм та даних (Лаб) /  "
                },
                {
                    "number": "4",
                    "time_bounds": "13:30 - 14:50",
                    "info": "207 /  Козленко М.І.  Безпека програм та даних (Л) /  "
                },
                {
                    "number": "5",
                    "time_bounds": "15:05 - 16:25",
                    "info": "320а /  Козленко М.І.  (підгр. 1)  /  Безпека програм та даних (Лаб) /  "
                },
                {
                    "number": "6",
                    "time_bounds": "16:40 - 18:00",
                    "info": "320а /  Козленко М.І.  (підгр. 2)  /  Безпека програм та даних (Лаб) /  "
                }
            ]
        },
        {
            "date": "10.04.2020 ",
            "day": "П'ятниця",
            "items": [
                {
                    "number": "2",
                    "time_bounds": "10:05 - 11:25",
                    "info": "232 /  Гайналь Т.О.  Філософія (Л) /  "
                },
                {
                    "number": "3",
                    "time_bounds": "11:55 - 13:15",
                    "info": "232 /  Гайналь Т.О.  Філософія (Сем) /  "
                }
            ]
        }
    ]
}

const groups = [
    "ІПЗ-11",
    "ІПЗ-1м",
    "ІПЗ-21",
    "ІПЗ-31",
    "ІПЗ-41"
]

const teachers = [
    "Волчовська-Козак Олександра Євгенівна",
    "Козак Ігор Іванович",
    "Козич Ігор Васильович",
    "Козич* Олег Васильович",
    "Козленко Микола Іванович",
    "Козлик Ігор Володимирович",
    "Коз‘якова Оксана Костянтинівна"
]

const faculties = [
    {
        "name": "Фізико-технічний факультет",
        "code": 1001
    },
    {
        "name": "Факультет математики та інформатики",
        "code": 1002
    },
    {
        "name": "Економічний факультет",
        "code": 1003
    },
    {
        "name": "Інститут післядипломної освіти та довузівської підготовки",
        "code": 1004
    },
    {
        "name": "Коломийський навчально-науковий інститут",
        "code": 1005
    },
    {
        "name": "Навчально-науковий Інститут мистецтв",
        "code": 1006
    },
    {
        "name": "Навчально-науковий Юридичний інститут",
        "code": 1007
    },
    {
        "name": "Педагогічний факультет",
        "code": 1008
    },
    {
        "name": "Факультет іноземних мов",
        "code": 1009
    },
    {
        "name": "Факультет історії, політології і міжнародних відносин",
        "code": 1010
    },
    {
        "name": "Факультет природничих наук",
        "code": 1011
    },
    {
        "name": "Факультет туризму",
        "code": 1012
    },
    {
        "name": "Факультет фізичного виховання і спорту",
        "code": 1013
    },
    {
        "name": "Факультет філології",
        "code": 1014
    },
    {
        "name": "Філософський факультет",
        "code": 1015
    },
    {
        "name": "Загальноуніверситетські кафедри",
        "code": 1016
    },
    {
        "name": "Івано-Франківський коледж",
        "code": 1017
    },
    {
        "name": "Кафедра військової підготовки",
        "code": 1019
    }
]

const resolvers = {
    Query: {
        scheduleResource: (obj, args) => {
            console.log(`🚀 ======================================================== []`);
            console.log("Group: " + args.group);
            return scheduleResource
        },
        groups: (obj, args) => {
            console.log(`🚀 ======================================================== []`);
            console.log("Query: " + args.query);
            return groups
        },
        teachers: (obj, args) => {
            console.log(`🚀 ======================================================== []`);
            console.log("Query: " + args.query);
            return teachers
        },
        faculties: () => {
            return faculties
        },
    },
};

exports.resolvers = resolvers
